package skinfotech.com.quotes;

import androidx.appcompat.app.AppCompatActivity;
import androidx.appcompat.widget.Toolbar;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;
import android.widget.AdapterView;
import android.widget.ArrayAdapter;
import android.widget.ListView;
import android.widget.TextView;

import com.google.android.gms.ads.AdRequest;
import com.google.android.gms.ads.InterstitialAd;

import java.util.ArrayList;

public class TamilQuotes extends AppCompatActivity {

    ListView listView;
    ArrayList<String>Tamil=new ArrayList<>();
    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_listview);
        listView=findViewById(R.id.listView);
        Tamil.add("எல்லோரும் பயணிக்கிறார்கள் என்று நீயும் பின்தொடராதே உனக்கான பாதையை நீயே தேர்ந்தெடு..");
        Tamil.add("'வெற்றியாளர்கள் முடிவுகளை விரைவில் எடுக்கிறார்கள்; அப்படி எடுத்த முடிவுகளை மிக மெதுவாகவே மாற்றுகிறார்கள். தோல்வியுறுபவர்களோ, முடிவுகளை மிக மெதுவாக எடுக்கிறார்கள்; அப்படி எடுத்த முடிவுகளை அடிக்கடியும், மிக விரைவாகவும் மாற்றுகிறார்கள்.");
        Tamil.add("சலித்துக் கொள்பவன் ஒவ்வொரு வாய்ப்பிலும் உள்ள ஆபத்தைப் பார்க்கிறான். சாதிப்பவன் ஒவ்வொரு ஆபத்திலும் உள்ள வாய்ப்பினைப் பார்க்கிறான்");
        Tamil.add("வெற்றி பெறுவது மிகவும் எளிதானதே. என்ன செய்கிறாய் என்பதை அறிந்து செய். செய்வதை விரும்பிச் செய். செய்வதை நம்பிக்கையோடு செய்");
        Tamil.add("அன்றாட வாழ்வின் சாதாரன விஷயங்களையும், அசாதாரன முறையில் செய்யும்போது உலகின் கவனத்தை உன் மீது திருப்ப முடியும்");
        Tamil.add("பலரும், தங்களது சூழ்நிலை சரியில்லை என்றே குறைப்பட்டுக் கொள்கிறார்கள். வெற்றியாளர்களோ எழுந்து, தங்களுக்கான சூழ்நிலையைத் தேடுகிறார்கள்; அத்தகைய சூழ்நிலை கிடைக்கவில்லையெனில், அவர்களே உருவாக்குகிறார்கள்");
        Tamil.add("வெற்றி என்பது, லட்சியத்தைப் படிப்படியாகப் புரிந்து கொள்வது");
        Tamil.add("தளராத இதயம் உள்ளவனுக்கு, இவ்வுலகில் முடியாதது என்று எதுவுமே இல்லை");
        Tamil.add("நான்தான் செய்து முடித்தேன் என்று மார்தட்டிக் கொள்கிற ஒவ்வொரு காரியத்துக்கும் நம்மையறியாமல் வேறொருவர் உந்து சக்தியாகவும் மூலகாரணமாகவும் இருக்கிறார்");
        Tamil.add("ஒரு மனிதனின் உண்மையான தன்மையை அறிய வேண்டுமானால், அவனுக்கு அதிகாரத்தை கொடுத்துப் பாருங்கள்");
        Tamil.add("உண்பதற்காக வாழாதே, உயிர் வாழ்வதற்காக உண்");
        Tamil.add("பறிபோன உரிமைகளை, பிச்சையாகப் பெற முடியாது. தீர்மானங்கள் மூலமோ, மன்றாடுவதன் மூலமோ, நியாயங்கள் பிறக்காது. ஆடுகளைத்தான் கோயில்கள் முன் வெட்டுகிறார்களே ஒழிய, சிங்கங்களை அல்ல");
        Tamil.add("ஆயிரம் ஆண்டு காலம் அடிமையாய் வாழ்வதைவிட, அரை நிமிடமேனும் சுதந்திர மனிதனாக வாழ்ந்து இறப்பது சாலச் சிறந்தது");
        Tamil.add("ஒருவன் தான் விரும்பும் நலன்கள் அனைத்தையும், மற்றவர்களுக்கும் உண்டாகச்செய்வதுதான் நாகரிகம்");
        Tamil.add("வேட்டைக்குப் போகும் யாரும் ''இந்தப் புலி நான் ஏமாந்த நேரம் பார்த்து என் மீது பாய்ந்துவிட்டது. இது நீதியில்லை'‘என்று புலம்பியதுண்டா?");
        Tamil.add("உதவி கிட்டும் என்ற நம்பிக்கையுடன், அஞ்சாமல் செயலில் ஈடுபடு. எங்கிருந்தாவது உதவி உன்னை வந்து சேரும். நம்பிக்கை இருந்தால், செயல் வெற்றி பெறும்!");
        Tamil.add("சுயமாக முன்னேறிய மனிதன் என்று ஒன்று கிடையாது. எனக்கு அதிக உதவிகள் கிட்டின. நான் கண்டுகொண்டது என்னவெனில், நீ உழைக்கத் தயாராய் இருந்தால், பலர் உனக்கு உதவத் தயாராய் இருக்கிறார்கள்");
        Tamil.add("ஒருவனுக்கு மீனைக் கொடு; அவனுக்கு நீ ஒரு நாள் மட்டுமே உணவளித்தவனாவாய். அவனுக்கு மீன் பிடிக்கக் கற்றுக் கொடு; அவனுக்கு நீ அவனது வாழ்நாள் முழுக்க உணவளித்தவனாவாய்");
        Tamil.add("துருப்பிடித்துத் தேய்வதை விட உழைத்துத் தேய்வதே நல்லது. நீ நினைத்தால், விண் மீனையும் விழுங்கிவிட முடியும். இதுவே உன் உண்மை பலம். மூட நம்பிக்கைகளை உதரித் தள்ளிவிட்டுத் தைரியமாகச் செயல்படு");
        Tamil.add("கடுமையான உழைப்பின்றி மகத்தான காரியங்களைச் சாதிக்க முடியாது. பயந்து புழுவைப்போல் மடிவதை விட, கடமை எனும் களத்திலே போரிட்டு உயிர் துறப்பது மேலானது");
        Tamil.add("எதுவும் செய்யாமல் இருப்பதைவிட ஏதாவது செய்வதே நல்லது; அதில் தவறு நேர்ந்தாலும் பாதகம் இல்லை");
        Tamil.add("எதிர் காலத்தில் என்ன நேருமோ என்று கணக்குப் பார்த்துக் கொண்டே இருப்பவனால் எதையும் சாதிக்க முடியாது. முயன்று செயல்களை செய்பவனே வாழ்க்கையில் வெற்றி பெறுவான்");
        Tamil.add("மாபெரும் லட்சியத்தையும் வெற்றியில் நம்பிக்கையையும் வாழ்க்கையில் ஏற்றுக்கொண்டால், யாரும் உயர்ந்த நிலையை அடைய முடியும்");
        Tamil.add("சுறுசுறுப்பாய் உள்ள மனிதன், எப்போதும் மகிழ்ச்சியோடு இருப்பான்");
        Tamil.add("திறமைதான் ஏழையின் மூலதனம் ");
        Tamil.add("வாழ்க்கையில் முன்னேற, குன்றாத உழைப்பு, குறையாத முயற்சி, வெற்றி பெறுவோம் என்ற தன்னம்பிக்கை - இம்மூன்றும் இருந்தால் போதும்");
        Tamil.add("பலவீனம் இடையறாத சித்திரவதையாகவும், துன்பமாகவும் அமைகிறது. பலவீனம் மரணத்திற்கு ஒப்பானது; வலிமையே மகிழ்ச்சிகரமான வாழ்க்கை");
        Tamil.add("உழைப்பு வறுமையை மட்டும் விரட்டவில்லை; தீமையையும் விரட்டுகிறது. - வால்டேர் உழைப்புதான் எல்லா செல்வங்களுக்கும், மதிப்புகளுக்கும் மூலம்");
        Tamil.add("உழைப்பின் முக்கிய பலன் இலாபமன்று; இலாபம் ஒரு உப பலமே. உழைப்பின் முக்கிய பலன் மனக் களிப்பே");
        Tamil.add("உன்னுடைய வாழ்க்கைக்கு மூச்சு எவ்வளவு அவசியமோ , அப்படியேதான் உழைப்பும். உழைப்பின்றி ஜீவிப்பதில் உற்சாகமில்லை");
        Tamil.add("நீ பிறந்தது வெற்றி மேல் வெற்றி பெறுவதற்கே; தோல்வியுற அல்ல. அப்படியே உன்னைத் தோல்வி வந்து அணைத்தாலும், அந்தத் தோல்வியும் ஒரு தற்காலிகத் தடையே. உனது தன்னம்பிக்கையே அந்தத் தடைகளைத் தகர்த்தெறியும்");
        Tamil.add("உன் வாழ்க்கையில் எப்போது தோல்விகள் நிற்கிறதோ, அப்போது வெற்றியும் நின்று விடுகிறது");
        Tamil.add("ஒரு மனிதன் விழாமலே வாழ்ந்தான் என்பது பெருமையல்லவிழுந்தபோதெல்லாம் எழுந்தான் என்பதுதான் பெருமை");
        Tamil.add("எந்தத் துறையையும் சார்ந்த, ஒவ்வொரு வெற்றியாளரும், சாதனையாளரும் இந்த வர்த்தைகளில் பொதிந்திருக்கும் மந்திரத்தை அறிந்திருப்பார்கள்: \"வாழ்க்கையில் சந்திக்கும் ஒவ்வொரு இடர்பாட்டிலும், மிகப் பெரிய அநுகூலத்திற்கான விதை ஒளிந்திருக்கிறது");
        Tamil.add("நீ வெற்றி பெற்றால், நீ பிறருக்கு நின்றுகொண்டு விளக்கத் தேவையில்லை. நீ தோற்றால் நீ அங்கு நின்று உன் தோல்விற்கான காரணங்களை விளக்கிக் கொண்டிருக்கக் கூடாது");
        Tamil.add("துன்பங்களுக்கு இடையில்தான் வாய்ப்புகள் ஒளிந்திருக்கின்றன");
        Tamil.add("எல்லாவற்றையும் இழந்து விட்டோம் என்று நினைக்கும் போது, ஒன்றை மறக்காதீர்கள்.எதிர்காலம் என்ற ஒன்று உண்டு");
        Tamil.add("இரவு எனும் காராக்கிரகம் நம்மைச் சூழ்ந்திடும்போதெல்லாம், காலைப் பகலவனின் அற்புத வெளிச்சம் நம்மை நெருங்கிவிட்டது என்பதே அர்த்தம்");
        Tamil.add("உன் வாழ்க்கையின் எந்த ஒரு நாளில் உன் முன்னால் எந்தப் பிரச்சினையையும் நீ சந்திக்காமல் முன் செல்கிறாயோ, அப்பொழுது தவறான பாதையில் நீ பயணிக்கிறாய் என்று அறிவாய்");
        Tamil.add("வெற்றி என்பது ஒவ்வொரு முறையும் முதல் இடத்தைப் பெறுவது என்று பொருள் அன்று. வெற்றி பெற்றாய் என்றால் உன் செயல்பாடு சென்ற முறையை விட இம்முறை சிறப்பாக அமைந்துள்ளது என்று பொருள். - பான்னி ப்ளேயர் எதை இழந்தீர்கள் என்பதல்ல முக்கியம், என்ன மிச்சம் இருக்கிறது என்பதே முக்கியம்");
        Tamil.add("கீழான லட்சியத்தில் வெற்றி காண்பதை விட, உயர்ந்த லட்சியத்தில் தோல்வி காண்பது சிறந்தது");
        Tamil.add("கீழே விழாமல் இருப்பதில் பெருமையில்லை. விழுந்த பொழுதெல்லாம் எழுந்திருப்பதே பெருமை");
        Tamil.add("துக்கத்தால் தற்கொலை செய்து கொள்பவன் தைரியசாலி என்றால், அந்தத் துக்கத்தைத் தாங்கிக் கொள்கிறவனோ பெரும் வீரன்");
        Tamil.add("அறிவு ஒன்றுதான் அச்சத்தை முறிக்கும் அரிய மருந்து. அறிவை வளர்த்துக் கொண்டால் எல்லாவிதமான பயங்களும் அகன்றுவிடும்");
        Tamil.add("அஞ்சி நடுங்கிக் கொண்டிருப்பவனால், சிறிய குட்டையைக் கூட கடக்க முடியாது-->\n" +
                "கடவுள் நம்பிக்கை உள்ளவன் எதற்கும் பயப்பட வேண்டியதில்லை. உனக்குப் பயம் ஏற்பட்டால், அது கடவுள் மேல் உனக்கிருக்கும் அவநம்பிக்கையையே காட்டுகிறது.");
        Tamil.add("நீ உயர்ந்து மேலே செல்லச் செல்ல, இன்னும் கீழேயே இருப்பவர்களுக்கு நீ சிறியவனாய்த் தோன்றுவதில் வியப்பொன்றும் இல்லை. அதனால், அவர்கள் உன் முயற்சிகளைப் பற்றி எள்ளி நகையாடினால், கண்டு கொள்ளாதே.");
        Tamil.add("உன் முயற்சிகளை ஏளனம் செய்வோரிடமிருந்து விலகியே இரு. சிறியோரே அவ்வாறு செய்வர்; மாறாக, உண்மையான பெரியோரோ உன்னாலும் முடியும் என்று உன்னை உணர வைப்பர்.-->\n" +
                "நியாயமில்லாத விமர்சனம்கூட ஒரு விதத்தில் பாராட்டேயாகும். நீ ஒருவரின் பொறாமையைத் தூண்டிவிட்டாய் என்பதையே இது காட்டுகிறது");
        Tamil.add("நீ உன் சிறகை விரிக்கும் வரை நீ எட்டும் உயரம் யாரறிவார்?");
        Tamil.add("விதைத்துக்கொண்டே இரு. முளைத்தால் மரம்; இல்லையேல் உரம்.");
        Tamil.add("கீழே விழாமல் இருப்பதில் பெருமையில்லை. விழுந்த பொழுதெல்லாம் எழுந்திருப்பதே பெருமை");
        Tamil.add("துக்கத்தால் தற்கொலை செய்து கொள்பவன் தைரியசாலி என்றால், அந்தத் துக்கத்தைத் தாங்கிக் கொள்கிறவனோ பெரும் வீரன்");
        Tamil.add("முயற்சியை எவனொருவன் கைவிடுகிறானோ,அப்போதே அவன் திறமை அவனிடமிருந்து போய் விடுகிறது");
        Tamil.add("உங்கள் குறைகளை நீங்களே அடையாளம் கண்டுகொள்வதுதான் வளர்ச்சியின் அடையாளம்");
        Tamil.add("நீங்கள் விரும்புவது ஒருவேளை உங்களுக்குக் கிடைக்காமல் போகலாம். ஆனால் உங்களுக்குத் தகுதியானது உங்களுக்குக் கண்டிப்பாகக் கிடைத்தே தீரும்");
//        Tamil.add("துக்கத்தால் தற்கொலை செய்து கொள்பவன் தைரியசாலி என்றால், அந்தத் துக்கத்தைத் தாங்கிக் கொள்கிறவனோ பெரும் வீரன்");

//      Tamil.add("துக்கத்தால் தற்கொலை செய்து கொள்பவன் தைரியசாலி என்றால், அந்தத் துக்கத்தைத் தாங்கிக் கொள்கிறவனோ பெரும் வீரன்");

        InterstitialAd mInterstitialAd = new InterstitialAd(this);
        mInterstitialAd.setAdUnitId("ca-app-pub-3643602219143275/5179430091");
        AdRequest Request = new AdRequest.Builder()
                .build();
        mInterstitialAd.loadAd(Request);
        Toolbar toolbar = findViewById(R.id.toolbar);
        setSupportActionBar(toolbar);
        getSupportActionBar().setDisplayHomeAsUpEnabled(true);
        getSupportActionBar().setDisplayShowHomeEnabled(true);
        toolbar.setNavigationOnClickListener(new View.OnClickListener() {
            @Override
            public void onClick(View v) {
                finish();
            }
        });
//        String[] arr = getResources().getStringArray(R.array.Tamil);
        listView.setAdapter(new ArrayAdapter<String>(this, R.layout.activity_motivational, R.id.motivational, Tamil));
        listView.setOnItemClickListener(new AdapterView.OnItemClickListener() {
            public void onItemClick(AdapterView<?> parent, View view,
                                    int position, long id) {
                String product = ((TextView) view).getText().toString();
                Intent i = new Intent(getApplicationContext(), ViewQuoteActivity.class);
                // sending data to new activity
                i.putExtra("product", product);
                startActivity(i);

            }
        });
    }


}